src/history/history10/KBe21hist201retWWICausesPowerStruggle.org
#+TITLE: germany, france, and russia

* https://docs.google.com/presentation/d/1dyNxeyOT3w2FXbv4WwQ--WB5kuead5wzThS5Rc5IGfs/edit#slide=id.g7934c51b3d_0_50 :source:
* germany and russia are both looking each other with paranoia
* because germany industrialized fast and russia has lots of people
* from 1880 to 1913, germany's manufacturing output share (of the world) doubles (table 18)
* table 19: everybody is amassing military, and nobody can be sure that the others aren't going to attack ([[file:KBrefSecurityDilemma.org][security dilemma]])
* table 20: great britain builds up it's navy (and is scared of germany because they've gone from 88k to 1.3M tons)
** dreadnaughts: germany comes up with a ship that makes all others obsolete, and an expensive arms race insues
** we can't be sure what people's motives were, can only look at old correspondences and journals
* alliances map
** french and british are teamed (which is strange because they'd been fighting)
*** although maybe it makes sense geographically, and they are both afraid of germany
** austria-hungary is very culturally diverse, which makes alliances awkward
*** italy might want italians back from austria
*** generally austrian civilians may not want to fight for austria
* alliances map again (but changes)
** italy is on the allied side now
** the ottoman empire (bulgaria too) have joined germany
*** ottomans have beef with both the austrians and russians
* colonial shenanigans in north africa
** british and french almost fought over north africa
** they marched their armies around and stared at eachother for a bit and almost had a big african war
* bad news bears in the Balkans
** ottoman empire falling apart
** austrians want to scoop up bits of the austrian empire
** serbia nationalists in austria want independence
** power vacuum in austria/russia's backyard
** archduke gets killed and a buch of preemptive wars are declared
** flo balkan crisis from palmer 661-664
*** general crises in the balkans
**** geographic background
***** ottoman empire, almost dissolved, 'still held a band of territory from Constantinople westward to the Adriatic'
***** south lay an indpendent greece, north had bulgarea and romania
***** small and landlocked serbia and bosnia-herzegovinia to the west
****** belonged legally to turkey but occupied and adminstered by austria since 1878
***** within the austro-hungarian empire next to bosnia on the north and west was croatia and slovenia
**** cultural division
***** altho Serbs, Bosnians, Croats, and Slovens all basically spoke Serbo-Croation, Serbs and Bosnians wrote eastern/Cyrillic while the Croats and Slovenes wrote with the western/roman alphabet
***** caused by diff in religion: Slovenes and Croats were Roman Catholic, and affiliated with the west. Serbs and 'many Bosnians' were Eastern Orthodox and closer to Russia
***** also many Muslim Slaves in Bosnia converted 'during the Ottoman domination'
**** upset slavs
***** "During the Slavic Revival, which emphasized language, many of these peoples felt like one people, the Yugoslavs (South Slavs)"
***** Dual Monarchy formed in 1867 -> Slavs of the Hasburg empire subordinate to German Austrians and Hungarian Magyars
***** radical Slav nationalists fed up of dual monachry by 1900, wanted indpendent Yugoslavia
***** 'Concretely, this meant that an element of the Austro-Hungarian population (the Croatian and Slovenian nationalists) wanted to get out and join with Serbia across the border).
**** events that set things off 'brought to a boil in 1908 by'
***** Young Turks carried through a revolution, 'obliged the sultan to restore the liberal parliamentary constitution of 1876', and tried to stop the dissolution of the Ottoman Empire by trying to get delegates from Bulgaria and Bosnia to set in the new Ottoman Parliament
***** Russia temporarily gave up on the Far East and wanted control of Constantinople
***** Austria wanted full annexation of Bosnia to discourage 'Pan-Yugoslav ideas?'
***** young Turks strengthened Ottoman Empire, then Austria would not get Bosnia, and Russians not Constantinople (Austria/Russia don't want Ottoman Empire strengthened)
*** first balkan crisis
**** austrian and russian foreign ministers secretly agreed in 1908 at Buchlau to call an international confrence
***** where russia would favor austrian annexation of bosnia, and austria would support the opening of the Straits to Russian warships
**** Austria immediately 'proclaimed the annexation of Bosnia without more ado'
***** -> infuriated the Serbs, who wanted Bosnia
**** later that year (1908), Bulgaria became independent and Crete joined Greece.
***** russians never got constantinople, russia's allies (britain and and france) didn't back them
**** basically, slavs got stepped on
* cult of the offensive (prisoners dilemma style)
** a popular theory for why WWI started
** timeline
*** heir assassinated
*** austria-hungary gets upset and issues ultimatums
*** serbia doesn't agree and austria declares war
*** russia backs serbia and declares war on austria hungary
*** germany declares war on russia, and france (preemptively)
*** everyone reciprocates, japan comes in from nowhere
** cult of the offensive
*** leaders believed that new technologies favored the offensive
*** formalizing the problem
**** states can preempt or defend
**** outcomes
***** best: i preempt, you defend (surprised)
***** both defend (peace)
***** both preempt (war)
***** i defend, you preempt (bad news bears for me)
***** *assumption is that preemption is better than defenese*
**** preempting vs defending is the prisoners dilemma
*** from any one perspective, preempting is always better than defending regardless of the other person
*** how could this have been avoided
**** third party to hold everyone accountable/defensive
**** mutually assured destruction
**** existing alliances
**** a balancer like the US could have mediated
