docs/history/history10/KBe21hist201retWWICausesPowerStruggle.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-11 Sat 16:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>germany, france, and russia</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://taproot3.sanity.gq/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://taproot3.sanity.gq/theindex.html"> HOME </a>
</div><div id="content">
<h1 class="title">germany, france, and russia</h1>

<div id="outline-container-orga234118" class="outline-2">
<h2 id="orga234118"><span class="section-number-2">1</span> <a href="https://docs.google.com/presentation/d/1dyNxeyOT3w2FXbv4WwQ--WB5kuead5wzThS5Rc5IGfs/edit#slide=id.g7934c51b3d_0_50">https://docs.google.com/presentation/d/1dyNxeyOT3w2FXbv4WwQ--WB5kuead5wzThS5Rc5IGfs/edit#slide=id.g7934c51b3d_0_50</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="source">source</span></span></h2>
</div>
<div id="outline-container-org0aa622c" class="outline-2">
<h2 id="org0aa622c"><span class="section-number-2">2</span> germany and russia are both looking each other with paranoia</h2>
</div>
<div id="outline-container-org327122a" class="outline-2">
<h2 id="org327122a"><span class="section-number-2">3</span> because germany industrialized fast and russia has lots of people</h2>
</div>
<div id="outline-container-org9e57f0a" class="outline-2">
<h2 id="org9e57f0a"><span class="section-number-2">4</span> from 1880 to 1913, germany's manufacturing output share (of the world) doubles (table 18)</h2>
</div>
<div id="outline-container-org8db4a95" class="outline-2">
<h2 id="org8db4a95"><span class="section-number-2">5</span> table 19: everybody is amassing military, and nobody can be sure that the others aren't going to attack (<a href="KBrefSecurityDilemma.html">security dilemma</a>)</h2>
</div>
<div id="outline-container-orgd122721" class="outline-2">
<h2 id="orgd122721"><span class="section-number-2">6</span> table 20: great britain builds up it's navy (and is scared of germany because they've gone from 88k to 1.3M tons)</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org12a084f" class="outline-3">
<h3 id="org12a084f"><span class="section-number-3">6.1</span> dreadnaughts: germany comes up with a ship that makes all others obsolete, and an expensive arms race insues</h3>
</div>
<div id="outline-container-org391b338" class="outline-3">
<h3 id="org391b338"><span class="section-number-3">6.2</span> we can't be sure what people's motives were, can only look at old correspondences and journals</h3>
</div>
</div>
<div id="outline-container-orga1a36d6" class="outline-2">
<h2 id="orga1a36d6"><span class="section-number-2">7</span> alliances map</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orga14986e" class="outline-3">
<h3 id="orga14986e"><span class="section-number-3">7.1</span> french and british are teamed (which is strange because they'd been fighting)</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-org11d18f8" class="outline-4">
<h4 id="org11d18f8"><span class="section-number-4">7.1.1</span> although maybe it makes sense geographically, and they are both afraid of germany</h4>
</div>
</div>
<div id="outline-container-org1bbd440" class="outline-3">
<h3 id="org1bbd440"><span class="section-number-3">7.2</span> austria-hungary is very culturally diverse, which makes alliances awkward</h3>
<div class="outline-text-3" id="text-7-2">
</div>
<div id="outline-container-org07fa384" class="outline-4">
<h4 id="org07fa384"><span class="section-number-4">7.2.1</span> italy might want italians back from austria</h4>
</div>
<div id="outline-container-org6377d4d" class="outline-4">
<h4 id="org6377d4d"><span class="section-number-4">7.2.2</span> generally austrian civilians may not want to fight for austria</h4>
</div>
</div>
</div>
<div id="outline-container-orgf787139" class="outline-2">
<h2 id="orgf787139"><span class="section-number-2">8</span> alliances map again (but changes)</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org8ff9cf3" class="outline-3">
<h3 id="org8ff9cf3"><span class="section-number-3">8.1</span> italy is on the allied side now</h3>
</div>
<div id="outline-container-org04ebf08" class="outline-3">
<h3 id="org04ebf08"><span class="section-number-3">8.2</span> the ottoman empire (bulgaria too) have joined germany</h3>
<div class="outline-text-3" id="text-8-2">
</div>
<div id="outline-container-orgb06a919" class="outline-4">
<h4 id="orgb06a919"><span class="section-number-4">8.2.1</span> ottomans have beef with both the austrians and russians</h4>
</div>
</div>
</div>
<div id="outline-container-org28c4993" class="outline-2">
<h2 id="org28c4993"><span class="section-number-2">9</span> colonial shenanigans in north africa</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orge2549c9" class="outline-3">
<h3 id="orge2549c9"><span class="section-number-3">9.1</span> british and french almost fought over north africa</h3>
</div>
<div id="outline-container-org6f56596" class="outline-3">
<h3 id="org6f56596"><span class="section-number-3">9.2</span> they marched their armies around and stared at eachother for a bit and almost had a big african war</h3>
</div>
</div>
<div id="outline-container-orgad76b83" class="outline-2">
<h2 id="orgad76b83"><span class="section-number-2">10</span> bad news bears in the Balkans</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org0f3f53a" class="outline-3">
<h3 id="org0f3f53a"><span class="section-number-3">10.1</span> ottoman empire falling apart</h3>
</div>
<div id="outline-container-org1c001b0" class="outline-3">
<h3 id="org1c001b0"><span class="section-number-3">10.2</span> austrians want to scoop up bits of the austrian empire</h3>
</div>
<div id="outline-container-orgf171dcb" class="outline-3">
<h3 id="orgf171dcb"><span class="section-number-3">10.3</span> serbia nationalists in austria want independence</h3>
</div>
<div id="outline-container-org0e95f7f" class="outline-3">
<h3 id="org0e95f7f"><span class="section-number-3">10.4</span> power vacuum in austria/russia's backyard</h3>
</div>
<div id="outline-container-orgeb5b898" class="outline-3">
<h3 id="orgeb5b898"><span class="section-number-3">10.5</span> archduke gets killed and a buch of preemptive wars are declared</h3>
</div>
<div id="outline-container-org3267443" class="outline-3">
<h3 id="org3267443"><span class="section-number-3">10.6</span> flo balkan crisis from palmer 661-664</h3>
<div class="outline-text-3" id="text-10-6">
</div>
<div id="outline-container-org2621419" class="outline-4">
<h4 id="org2621419"><span class="section-number-4">10.6.1</span> general crises in the balkans</h4>
<div class="outline-text-4" id="text-10-6-1">
</div>
<ol class="org-ol">
<li><a id="org9f9284e"></a>geographic background<br />
<ol class="org-ol">
<li><a id="orgaca47a4"></a>ottoman empire, almost dissolved, 'still held a band of territory from Constantinople westward to the Adriatic'<br /></li>
<li><a id="org0dd3a3a"></a>south lay an indpendent greece, north had bulgarea and romania<br /></li>
<li><a id="org6f7c4f1"></a>small and landlocked serbia and bosnia-herzegovinia to the west<br />
<ol class="org-ol">
<li><a id="org09950bf"></a>belonged legally to turkey but occupied and adminstered by austria since 1878<br /></li>
</ol>
</li>
<li><a id="org5391691"></a>within the austro-hungarian empire next to bosnia on the north and west was croatia and slovenia<br /></li>
</ol>
</li>
<li><a id="org8f1565e"></a>cultural division<br />
<ol class="org-ol">
<li><a id="orgc35f4c0"></a>altho Serbs, Bosnians, Croats, and Slovens all basically spoke Serbo-Croation, Serbs and Bosnians wrote eastern/Cyrillic while the Croats and Slovenes wrote with the western/roman alphabet<br /></li>
<li><a id="org56953a6"></a>caused by diff in religion: Slovenes and Croats were Roman Catholic, and affiliated with the west. Serbs and 'many Bosnians' were Eastern Orthodox and closer to Russia<br /></li>
<li><a id="orgec44ed6"></a>also many Muslim Slaves in Bosnia converted 'during the Ottoman domination'<br /></li>
</ol>
</li>
<li><a id="org22b0d13"></a>upset slavs<br />
<ol class="org-ol">
<li><a id="org17b918a"></a>"During the Slavic Revival, which emphasized language, many of these peoples felt like one people, the Yugoslavs (South Slavs)"<br /></li>
<li><a id="org6e4aee0"></a>Dual Monarchy formed in 1867 -&gt; Slavs of the Hasburg empire subordinate to German Austrians and Hungarian Magyars<br /></li>
<li><a id="org4ae36f3"></a>radical Slav nationalists fed up of dual monachry by 1900, wanted indpendent Yugoslavia<br /></li>
<li><a id="org3f39be6"></a>'Concretely, this meant that an element of the Austro-Hungarian population (the Croatian and Slovenian nationalists) wanted to get out and join with Serbia across the border).<br /></li>
</ol>
</li>
<li><a id="org17358c4"></a>events that set things off 'brought to a boil in 1908 by'<br />
<ol class="org-ol">
<li><a id="org55f55e3"></a>Young Turks carried through a revolution, 'obliged the sultan to restore the liberal parliamentary constitution of 1876', and tried to stop the dissolution of the Ottoman Empire by trying to get delegates from Bulgaria and Bosnia to set in the new Ottoman Parliament<br /></li>
<li><a id="org8886799"></a>Russia temporarily gave up on the Far East and wanted control of Constantinople<br /></li>
<li><a id="orgd1c3784"></a>Austria wanted full annexation of Bosnia to discourage 'Pan-Yugoslav ideas?'<br /></li>
<li><a id="orgc41557f"></a>young Turks strengthened Ottoman Empire, then Austria would not get Bosnia, and Russians not Constantinople (Austria/Russia don't want Ottoman Empire strengthened)<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org3c70162" class="outline-4">
<h4 id="org3c70162"><span class="section-number-4">10.6.2</span> first balkan crisis</h4>
<div class="outline-text-4" id="text-10-6-2">
</div>
<ol class="org-ol">
<li><a id="org19529f3"></a>austrian and russian foreign ministers secretly agreed in 1908 at Buchlau to call an international confrence<br />
<ol class="org-ol">
<li><a id="org19c9305"></a>where russia would favor austrian annexation of bosnia, and austria would support the opening of the Straits to Russian warships<br /></li>
</ol>
</li>
<li><a id="org68b89c5"></a>Austria immediately 'proclaimed the annexation of Bosnia without more ado'<br />
<ol class="org-ol">
<li><a id="org838b4f7"></a>-&gt; infuriated the Serbs, who wanted Bosnia<br /></li>
</ol>
</li>
<li><a id="org95b84fd"></a>later that year (1908), Bulgaria became independent and Crete joined Greece.<br />
<ol class="org-ol">
<li><a id="orga81fd6b"></a>russians never got constantinople, russia's allies (britain and and france) didn't back them<br /></li>
</ol>
</li>
<li><a id="org365ed40"></a>basically, slavs got stepped on<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgc5c4a99" class="outline-2">
<h2 id="orgc5c4a99"><span class="section-number-2">11</span> cult of the offensive (prisoners dilemma style)</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org4776e9c" class="outline-3">
<h3 id="org4776e9c"><span class="section-number-3">11.1</span> a popular theory for why WWI started</h3>
</div>
<div id="outline-container-org946af78" class="outline-3">
<h3 id="org946af78"><span class="section-number-3">11.2</span> timeline</h3>
<div class="outline-text-3" id="text-11-2">
</div>
<div id="outline-container-orgfad78e6" class="outline-4">
<h4 id="orgfad78e6"><span class="section-number-4">11.2.1</span> heir assassinated</h4>
</div>
<div id="outline-container-org859c0c8" class="outline-4">
<h4 id="org859c0c8"><span class="section-number-4">11.2.2</span> austria-hungary gets upset and issues ultimatums</h4>
</div>
<div id="outline-container-org8b8c357" class="outline-4">
<h4 id="org8b8c357"><span class="section-number-4">11.2.3</span> serbia doesn't agree and austria declares war</h4>
</div>
<div id="outline-container-org7169486" class="outline-4">
<h4 id="org7169486"><span class="section-number-4">11.2.4</span> russia backs serbia and declares war on austria hungary</h4>
</div>
<div id="outline-container-org546fb8e" class="outline-4">
<h4 id="org546fb8e"><span class="section-number-4">11.2.5</span> germany declares war on russia, and france (preemptively)</h4>
</div>
<div id="outline-container-org109c704" class="outline-4">
<h4 id="org109c704"><span class="section-number-4">11.2.6</span> everyone reciprocates, japan comes in from nowhere</h4>
</div>
</div>
<div id="outline-container-orgec8a47a" class="outline-3">
<h3 id="orgec8a47a"><span class="section-number-3">11.3</span> cult of the offensive</h3>
<div class="outline-text-3" id="text-11-3">
</div>
<div id="outline-container-org7fc993c" class="outline-4">
<h4 id="org7fc993c"><span class="section-number-4">11.3.1</span> leaders believed that new technologies favored the offensive</h4>
</div>
<div id="outline-container-org8c5486e" class="outline-4">
<h4 id="org8c5486e"><span class="section-number-4">11.3.2</span> formalizing the problem</h4>
<div class="outline-text-4" id="text-11-3-2">
</div>
<ol class="org-ol">
<li><a id="orgf38f2b5"></a>states can preempt or defend<br /></li>
<li><a id="org6459558"></a>outcomes<br />
<ol class="org-ol">
<li><a id="org7fb0617"></a>best: i preempt, you defend (surprised)<br /></li>
<li><a id="org9ce4d56"></a>both defend (peace)<br /></li>
<li><a id="org54d07af"></a>both preempt (war)<br /></li>
<li><a id="org3232137"></a>i defend, you preempt (bad news bears for me)<br /></li>
<li><a id="orgfed5807"></a><b>assumption is that preemption is better than defenese</b><br /></li>
</ol>
</li>
<li><a id="orgbdc1e81"></a>preempting vs defending is the prisoners dilemma<br /></li>
</ol>
</div>
<div id="outline-container-org6d23a06" class="outline-4">
<h4 id="org6d23a06"><span class="section-number-4">11.3.3</span> from any one perspective, preempting is always better than defending regardless of the other person</h4>
</div>
<div id="outline-container-org15e9fa6" class="outline-4">
<h4 id="org15e9fa6"><span class="section-number-4">11.3.4</span> how could this have been avoided</h4>
<div class="outline-text-4" id="text-11-3-4">
</div>
<ol class="org-ol">
<li><a id="orge1c67fb"></a>third party to hold everyone accountable/defensive<br /></li>
<li><a id="orga904758"></a>mutually assured destruction<br /></li>
<li><a id="org64ed20f"></a>existing alliances<br /></li>
<li><a id="org324752a"></a>a balancer like the US could have mediated<br />
<div class="outline-text-5" id="text-11-3-4-4">
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="namedate"><p class="subtitle"><span class="author">Taproot</span><span class="date">2021-09-11 Sat 16:34</span></p></div><div class="taprootcopyright">(c) 2021 Houjun Liu, Huxley Marvit, Zachary Sayyah, Albert Huang, Dylan Wallace</div>
</div>
</body>
</html>
