docs/history/history10/KBe21hist201retWWICausesPowerStruggle.tex
% Created 2021-09-11 Sat 16:40
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{germany, france, and russia}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={germany, france, and russia},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{\url{https://docs.google.com/presentation/d/1dyNxeyOT3w2FXbv4WwQ--WB5kuead5wzThS5Rc5IGfs/edit\#slide=id.g7934c51b3d\_0\_50}\hfill{}\textsc{source}}
\label{sec:org42d2e55}
\section{germany and russia are both looking each other with paranoia}
\label{sec:orga889b96}
\section{because germany industrialized fast and russia has lots of people}
\label{sec:org6278c67}
\section{from 1880 to 1913, germany's manufacturing output share (of the world) doubles (table 18)}
\label{sec:org580cf8e}
\section{table 19: everybody is amassing military, and nobody can be sure that the others aren't going to attack (\href{KBrefSecurityDilemma.org}{security dilemma})}
\label{sec:org38eb573}
\section{table 20: great britain builds up it's navy (and is scared of germany because they've gone from 88k to 1.3M tons)}
\label{sec:org048ad66}
\subsection{dreadnaughts: germany comes up with a ship that makes all others obsolete, and an expensive arms race insues}
\label{sec:org49034cc}
\subsection{we can't be sure what people's motives were, can only look at old correspondences and journals}
\label{sec:org13db45b}
\section{alliances map}
\label{sec:orga0a492f}
\subsection{french and british are teamed (which is strange because they'd been fighting)}
\label{sec:org04ed60a}
\subsubsection{although maybe it makes sense geographically, and they are both afraid of germany}
\label{sec:org55634d6}
\subsection{austria-hungary is very culturally diverse, which makes alliances awkward}
\label{sec:orgf276db1}
\subsubsection{italy might want italians back from austria}
\label{sec:orgeb20497}
\subsubsection{generally austrian civilians may not want to fight for austria}
\label{sec:org108fff8}
\section{alliances map again (but changes)}
\label{sec:orgabd9709}
\subsection{italy is on the allied side now}
\label{sec:org2ab4c8d}
\subsection{the ottoman empire (bulgaria too) have joined germany}
\label{sec:org83c1c43}
\subsubsection{ottomans have beef with both the austrians and russians}
\label{sec:org88bbad8}
\section{colonial shenanigans in north africa}
\label{sec:org4db42d0}
\subsection{british and french almost fought over north africa}
\label{sec:orgd33d06d}
\subsection{they marched their armies around and stared at eachother for a bit and almost had a big african war}
\label{sec:orgb896706}
\section{bad news bears in the Balkans}
\label{sec:org9a35245}
\subsection{ottoman empire falling apart}
\label{sec:org68ef3f9}
\subsection{austrians want to scoop up bits of the austrian empire}
\label{sec:orga0fcff8}
\subsection{serbia nationalists in austria want independence}
\label{sec:org4b3814c}
\subsection{power vacuum in austria/russia's backyard}
\label{sec:orga614c39}
\subsection{archduke gets killed and a buch of preemptive wars are declared}
\label{sec:orge34cbaa}
\subsection{flo balkan crisis from palmer 661-664}
\label{sec:orga9414c4}
\subsubsection{general crises in the balkans}
\label{sec:org4c786d7}
\begin{enumerate}
\item geographic background
\label{sec:org663083d}
\begin{enumerate}
\item ottoman empire, almost dissolved, 'still held a band of territory from Constantinople westward to the Adriatic'
\label{sec:org2f3baa7}
\item south lay an indpendent greece, north had bulgarea and romania
\label{sec:orgd333da3}
\item small and landlocked serbia and bosnia-herzegovinia to the west
\label{sec:org325b319}
\begin{enumerate}
\item belonged legally to turkey but occupied and adminstered by austria since 1878
\label{sec:orgd14b345}
\end{enumerate}
\item within the austro-hungarian empire next to bosnia on the north and west was croatia and slovenia
\label{sec:org90319ce}
\end{enumerate}
\item cultural division
\label{sec:org6deb082}
\begin{enumerate}
\item altho Serbs, Bosnians, Croats, and Slovens all basically spoke Serbo-Croation, Serbs and Bosnians wrote eastern/Cyrillic while the Croats and Slovenes wrote with the western/roman alphabet
\label{sec:orgce00c7b}
\item caused by diff in religion: Slovenes and Croats were Roman Catholic, and affiliated with the west. Serbs and 'many Bosnians' were Eastern Orthodox and closer to Russia
\label{sec:org13c9e62}
\item also many Muslim Slaves in Bosnia converted 'during the Ottoman domination'
\label{sec:orgd5dcda6}
\end{enumerate}
\item upset slavs
\label{sec:orgecf24a5}
\begin{enumerate}
\item "During the Slavic Revival, which emphasized language, many of these peoples felt like one people, the Yugoslavs (South Slavs)"
\label{sec:orgedb805c}
\item Dual Monarchy formed in 1867 -> Slavs of the Hasburg empire subordinate to German Austrians and Hungarian Magyars
\label{sec:org656ac50}
\item radical Slav nationalists fed up of dual monachry by 1900, wanted indpendent Yugoslavia
\label{sec:orgb8b316b}
\item 'Concretely, this meant that an element of the Austro-Hungarian population (the Croatian and Slovenian nationalists) wanted to get out and join with Serbia across the border).
\label{sec:orgfad0079}
\end{enumerate}
\item events that set things off 'brought to a boil in 1908 by'
\label{sec:orgedfde92}
\begin{enumerate}
\item Young Turks carried through a revolution, 'obliged the sultan to restore the liberal parliamentary constitution of 1876', and tried to stop the dissolution of the Ottoman Empire by trying to get delegates from Bulgaria and Bosnia to set in the new Ottoman Parliament
\label{sec:org2cb647f}
\item Russia temporarily gave up on the Far East and wanted control of Constantinople
\label{sec:org20a178e}
\item Austria wanted full annexation of Bosnia to discourage 'Pan-Yugoslav ideas?'
\label{sec:org90f2ab8}
\item young Turks strengthened Ottoman Empire, then Austria would not get Bosnia, and Russians not Constantinople (Austria/Russia don't want Ottoman Empire strengthened)
\label{sec:org62a2609}
\end{enumerate}
\end{enumerate}
\subsubsection{first balkan crisis}
\label{sec:orgb5651be}
\begin{enumerate}
\item austrian and russian foreign ministers secretly agreed in 1908 at Buchlau to call an international confrence
\label{sec:org11853db}
\begin{enumerate}
\item where russia would favor austrian annexation of bosnia, and austria would support the opening of the Straits to Russian warships
\label{sec:org81cd7da}
\end{enumerate}
\item Austria immediately 'proclaimed the annexation of Bosnia without more ado'
\label{sec:org7d5d317}
\begin{enumerate}
\item -> infuriated the Serbs, who wanted Bosnia
\label{sec:orgdfe334a}
\end{enumerate}
\item later that year (1908), Bulgaria became independent and Crete joined Greece.
\label{sec:org4cb0a2e}
\begin{enumerate}
\item russians never got constantinople, russia's allies (britain and and france) didn't back them
\label{sec:org2c42b91}
\end{enumerate}
\item basically, slavs got stepped on
\label{sec:org4010857}
\end{enumerate}
\section{cult of the offensive (prisoners dilemma style)}
\label{sec:orgf914f61}
\subsection{a popular theory for why WWI started}
\label{sec:org18b12f0}
\subsection{timeline}
\label{sec:orgd77ffb7}
\subsubsection{heir assassinated}
\label{sec:org9c47671}
\subsubsection{austria-hungary gets upset and issues ultimatums}
\label{sec:org07a4082}
\subsubsection{serbia doesn't agree and austria declares war}
\label{sec:org5b77b99}
\subsubsection{russia backs serbia and declares war on austria hungary}
\label{sec:orgf869082}
\subsubsection{germany declares war on russia, and france (preemptively)}
\label{sec:orgb9e6fbb}
\subsubsection{everyone reciprocates, japan comes in from nowhere}
\label{sec:orgdb8c417}
\subsection{cult of the offensive}
\label{sec:orgfb9e1cc}
\subsubsection{leaders believed that new technologies favored the offensive}
\label{sec:org42c45a8}
\subsubsection{formalizing the problem}
\label{sec:orgdfed0a1}
\begin{enumerate}
\item states can preempt or defend
\label{sec:org2064a2f}
\item outcomes
\label{sec:org9f22356}
\begin{enumerate}
\item best: i preempt, you defend (surprised)
\label{sec:org1404dd1}
\item both defend (peace)
\label{sec:org8460f9e}
\item both preempt (war)
\label{sec:org2116f5c}
\item i defend, you preempt (bad news bears for me)
\label{sec:org46ffd91}
\item \textbf{assumption is that preemption is better than defenese}
\label{sec:org7e6955f}
\end{enumerate}
\item preempting vs defending is the prisoners dilemma
\label{sec:org7acb9b4}
\end{enumerate}
\subsubsection{from any one perspective, preempting is always better than defending regardless of the other person}
\label{sec:org990f7af}
\subsubsection{how could this have been avoided}
\label{sec:org14fc6e4}
\begin{enumerate}
\item third party to hold everyone accountable/defensive
\label{sec:org1b95a6d}
\item mutually assured destruction
\label{sec:org3b7a003}
\item existing alliances
\label{sec:org88bbde4}
\item a balancer like the US could have mediated
\label{sec:org48ed727}
\end{enumerate}
\end{document}
